<a href="https://colab.research.google.com/github/alekhaya99/Pandas_Tutorial/blob/master/Pandas_Data_Structures.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd

# Series

Series is a one dimensional array-like object contaning a sequence of values and associated array of data labels called it index

In [32]:
object=pd.Series([4,7,-5,3])
object

0    4
1    7
2   -5
3    3
dtype: int64

In [33]:
#In order to get the index
object.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
#In order to find out the values 
object.values

array([ 4,  7, -5,  3])

In [11]:
#In order to add labeling of the index
object_2 = pd.Series([1,2,3,4], index=['a','b','c','d'])
object_2

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
object_2['a']

1

In [13]:
object_2['a']=0

In [14]:
object_2[['a','b','c']]

a    0
b    2
c    3
dtype: int64

In [15]:
object_2[object_2>2]

c    3
d    4
dtype: int64

In [16]:
import numpy as np
np.exp(object_2)

a     1.000000
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [17]:
'b' in object_2

True

In [18]:
#Converting a Python Dictionary into Panda series
Dict={'Singapore':'Singapore','India':'Delhi','Philippines':'Manila'}
Object_3=pd.Series(Dict)
Object_3

Singapore      Singapore
India              Delhi
Philippines       Manila
dtype: object

In [19]:
Countries=['Philippines','India','USA']
Object_4=pd.Series(Object_3,index=Countries)
Object_4

Philippines    Manila
India           Delhi
USA               NaN
dtype: object

In [20]:
pd.isnull(Object_4)

Philippines    False
India          False
USA             True
dtype: bool

In [21]:
pd.notnull(Object_4)

Philippines     True
India           True
USA            False
dtype: bool

In [22]:
Object_3+Object_4

India            DelhiDelhi
Philippines    ManilaManila
Singapore               NaN
USA                     NaN
dtype: object

In [27]:
Object_4.name='Name of Contries'
Object_4.index.name='Country'
Object_4

Country
Philippines    Manila
India           Delhi
USA               NaN
Name: Name of Contries, dtype: object

In [35]:
object.index=['M','A','R','K']
object

M    4
A    7
R   -5
K    3
dtype: int64

# DataFrame

According to https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:





*  Dict of 1D ndarrays, lists, dicts, or Series 
*  2-D numpy.ndarray


*  Structured or record ndarray
*  A Series


*   Another DataFrame










Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

If axis labels are not passed, they will be constructed from the input data based on common sense rules.

In [38]:
Class_Student=pd.DataFrame({'Name':['A','B','C','D','E','F'],'Marks':['Sixty-eight','Ninty-Eight','Fifty','Seventy','Hundred','Ninty'],'RollNo':[1,2,3,4,5,6]})
Class_Student

  Name        Marks  RollNo
0    A  Sixty-eight       1
1    B  Ninty-Eight       2
2    C        Fifty       3
3    D      Seventy       4
4    E      Hundred       5
5    F        Ninty       6

In [39]:
#If the data frame is large the .head option could be used. This will only select the first five rows
Class_Student.head()

  Name        Marks  RollNo
0    A  Sixty-eight       1
1    B  Ninty-Eight       2
2    C        Fifty       3
3    D      Seventy       4
4    E      Hundred       5

In [70]:
#In order to arrang the data in the specific column
pd.DataFrame(Class_Student,columns=['RollNo','Name','Marks','Average'])

   RollNo Name        Marks  Average
0       1    A  Sixty-eight      NaN
1       2    B  Ninty-Eight      NaN
2       3    C        Fifty      NaN
3       4    D      Seventy      NaN
4       5    E      Hundred      NaN
5       6    F        Ninty      NaN

In [71]:
Class_Student['Name']

0    A
1    B
2    C
3    D
4    E
5    F
Name: Name, dtype: object

In [72]:
Class_Student.Name

0    A
1    B
2    C
3    D
4    E
5    F
Name: Name, dtype: object

In [73]:
#The rows attribuute could be retrived by the 'loc' command
Class_Student.loc[0]

Name                A
Marks     Sixty-eight
RollNo              1
Name: 0, dtype: object

In [74]:
Class_Student1=pd.DataFrame(Class_Student,columns=['RollNo','Name','Marks','Status'])

In [75]:
#In Pandas we can modify the data structures
Class_Student1['Status']='Pass'
Class_Student1

   RollNo Name        Marks Status
0       1    A  Sixty-eight   Pass
1       2    B  Ninty-Eight   Pass
2       3    C        Fifty   Pass
3       4    D      Seventy   Pass
4       5    E      Hundred   Pass
5       6    F        Ninty   Pass

In [76]:
import numpy as np

In [77]:
Class_Student1['Status']=np.random.rand()
Class_Student1

   RollNo Name        Marks   Status
0       1    A  Sixty-eight  0.10769
1       2    B  Ninty-Eight  0.10769
2       3    C        Fifty  0.10769
3       4    D      Seventy  0.10769
4       5    E      Hundred  0.10769
5       6    F        Ninty  0.10769

In [78]:
Value=pd.Series([30,40,50],index=[0,1,2])
Class_Student1['Status']=Value
Class_Student1

   RollNo Name        Marks  Status
0       1    A  Sixty-eight    30.0
1       2    B  Ninty-Eight    40.0
2       3    C        Fifty    50.0
3       4    D      Seventy     NaN
4       5    E      Hundred     NaN
5       6    F        Ninty     NaN

In [79]:
#The 'del' keyword is used to delete the Columns
del Class_Student1['Status']
Class_Student1

   RollNo Name        Marks
0       1    A  Sixty-eight
1       2    B  Ninty-Eight
2       3    C        Fifty
3       4    D      Seventy
4       5    E      Hundred
5       6    F        Ninty

In [81]:
#We can add a dictionary to the DataFrame as well
Example=pd.DataFrame({'ABC':{'Maths':49,'Physics':56,'Chemistry':76},'XYZ':{'Maths':49,'Physics':56,'Chemistry':76,'Biology':54}})
Example

            ABC  XYZ
Maths      49.0   49
Physics    56.0   56
Chemistry  76.0   76
Biology     NaN   54

In [82]:
#We can also transpose the DataFrame
Example.T

     Maths  Physics  Chemistry  Biology
ABC   49.0     56.0       76.0      NaN
XYZ   49.0     56.0       76.0     54.0

In [83]:
pd.DataFrame(Example,index=['English','Maths','Physics'])

          ABC   XYZ
English   NaN   NaN
Maths    49.0  49.0
Physics  56.0  56.0

In [86]:
Example.index.name='Subject'
Example.columns.name='Name'
Example

Name        ABC  XYZ
Subject
Maths      49.0   49
Physics    56.0   56
Chemistry  76.0   76
Biology     NaN   54

In [87]:
Example.values

array([[49., 49.],
       [56., 56.],
       [76., 76.],
       [nan, 54.]])